# Hackathon 1: Python, ETL and Visualisation

## Objective

* The objective of this notebook is to fetch data from Kaggle, save it as raw data and complete the initial data cleaning process.

### Import Packages

In [1]:
import pandas as pd
import numpy as np

The healthcare insurance dataset will be read and loaded into a DataFrame, so the initial data cleaning will begin.

In [2]:
df = pd.read_csv('../data/inputs/raw/insurance.csv')
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

Matplotlib, Seaborn & Plotly libraries will be imported for future data visualisation

In [4]:
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
import plotly.express as px

### Initial Data Cleaning

The contents of this DataFrame will be summarised

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

The first 5 rows of the DataFrame will be viewed for a quick inspection of the data, check column names, understand the data structure and potential debugging.

In [7]:
df.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

A brief overview of the key metrics of the dataset will be shown below.

In [9]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

Checking for duplicates within the dataset.

In [11]:
df.duplicated().sum()

1

In [13]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1333    False
1334    False
1335    False
1336    False
1337    False
Length: 1338, dtype: bool

### Searching for duplicates by column

In [25]:
duplicates_by_age = df[df.duplicated(subset=['age'])]

In [16]:
duplicates_by_sex = df[df.duplicated(subset=['sex'])]

In [17]:
duplicates_by_bmi = df[df.duplicated(subset=['bmi'])]

In [18]:
duplicates_by_children = df[df.duplicated(subset=['children'])]

In [21]:
duplicates_by_smoker = df[df.duplicated(subset=['smoker'])]

In [22]:
duplicates_by_region = df[df.duplicated(subset=['region'])]

In [23]:
duplicates_by_charges = df[df.duplicated(subset=['charges'])]

### Searching for duplicates by row

In [27]:
df[df.duplicated()]

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

#### One duplicated row has been identified and will be removed from the dataset

In [23]:
df_no_duplicates = df.drop_duplicates()

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [25]:
df.sample(n=5)

      age     sex     bmi  children smoker     region      charges
1335   18  female  36.850         0     no  southeast   1629.83350
518    35  female  31.000         1     no  southwest   5240.76500
735    49  female  34.770         1     no  northwest   9583.89330
409    32    male  30.030         1     no  southeast   4074.45370
752    64    male  37.905         0     no  northwest  14210.53595

To check for and indentify duplicates in the dataset.

In [29]:
duplicates = df[df.duplicated()]
duplicates

     age   sex    bmi  children smoker     region    charges
581   19  male  30.59         0     no  northwest  1639.5631

Duplicates will be removed and the dataset will checked to ensure all duplicates are successfully removed.

In [30]:
print(df.shape)

(1338, 7)

In [31]:
df = df.drop_duplicates()

In [32]:
print(df.shape)

(1337, 7)

Column names will be investigated to ensure there are no unusual column names.

In [33]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

Property types of the columns will now be investigated to ensure they are correct.

In [34]:
df.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

The dataset will now be checked for missing values.

In [36]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

The initial dataset cleaning is complete. The dataset will now be saved as a new file for the next stage of cleaning.

In [37]:
df.to_csv('../data/inputs/cleaned_data.csv', index=False)